{
  "education": [
    {
      "awards_achievements": [
        "Graduated with Distinction",
        "GPA: 3.49"
      ],
      "degree": "Software Engineering Technology",
      "department": "Applied Computer Science and IT",
      "duration": "2018-2021",
      "school_name": "Conestoga College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_MarissaSchmitt",
  "highlighted_projects": [
    {
      "description": "Created a proof-of-concept EMR system for Otekha Health using ReactJS, Java RESTful server, Docker, MongoDB, MySQL, Redis, and HAPI-FHIR API. The development of this application followed an agile methodology and a Docker-built architecture. Synthea was used to generate sample patient FHIR data for testing purposes. MongoDB was used to hold the sample FHIR data retrieved from the RESTful server. MySQL was used for authentication within the app. Redis was used for access control (NGAC). The application allowed for users to customize the widgets that would be on their screen at once, including calendar, test results, medication, etc. Information could be added, removed, or modified within each component on the screen. The calendar application could be used to create a new event and bring the user to a new window where the corresponding patients' data would be displayed. The system was designed with the intention of being a customizable version of the OSCAR EMR system.",
      "git_url": null,
      "name": "Electronic Medical Records System"
    },
    {
      "description": "Implemented a Point-of-Sale system using .NET and MySQL. This system allows users to update, delete, and retrieve data through the .NET WPF frontend. This project highlighted aspects of working with the database and communicating the data retrieved from the constructed queries in a user-friendly format. The app was built on event-driven architecture where CRUD operations would be executed based on the event evoked by the user. It also allows for receipt creation simulation when a new order is created where the virtual receipt displays the current date of the new record, id, list of items along with their assigned prices, and includes the calculated total.",
      "git_url": null,
      "name": "Point-of-Sale System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Linux cluster monitoring agent to manage and insert resource data, such as CPU, RAM, disk usage into a PostgreSQL database hosted by Docker. The host usage information was collected through bash commands and automated using crontab. The data collected by the app can be returned as a result set by using SQL queries which also includes detecting crontab insertion failure using SQL aggregate functions to compare the number of entries within a span of five minutes. Other information, such as retrieving number of CPUs and amount of total memory can be used for data analytics when query the database. This app was developed and run within a CentOS7 environment.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: In-progress",
        "JDBC App: Developed a Java application that uses Java Database Connectivity (JDBC) to insert and perform CRUD operations on data stored in a Docker-hosted PostgreSQL database. This project uses Java 8, RDBMS, JDBC, PSQL, Maven, Docker, DAO, and DTOs.",
        "Grep App: Implemented an application to simulate the Linux grep command using core Java, Maven, and Docker. It uses Java 8 lambdas and stream APIs to optimize the memory usage. This app is deployed on DockerHub and was developed/debugged using IntelliJ."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Marissa Schmitt",
  "others": [
    {
      "bullets": [
        "Reading",
        "Learning new technologies"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed a variety of different applications using an Agile methodology. Acted as a team lead role to organize and lead daily scrum meetings with the team. Java, Linux, SQL, Docker, and bash scripts were used in developing. I also gained more experience with team collaboration and organization skills related to scrum through the use of Notion for projects to manage my sprint backlog. Leadership was another soft skill gained from the Jarvis opportunity since every new sprint allows a developer to take on the role of team lead and direct the group in scrum meetings. My ability to problem-solve has increased because of the challenges and questions posed by the assignments to ensure that I understand the technical aspects of the projects being developed and can relate the concepts to my prior knowledge.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "Otekha Health",
      "description": "Established new soft skills from working with Otekha Health including team collaboration within a remote agile environment, the ability to learn unfamiliar technologies and understand requirements based on virtual stand-up meeting discussions. Also, the ability to write software documentation such as an agile Software Requirement Specification (SRS) about the system. Refer to Electronic Medical Records System in Highlighted Projects section for system details.",
      "duration": "2021",
      "title": "Intern"
    },
    {
      "company": "Focus Computers Inc",
      "description": "Performed repairs on customers' computers using different software tools and problem-solving techniques. ",
      "duration": "2018",
      "title": "Co-op Student"
    }
  ],
  "skills": {
    "competent": [
      "C++",
      "C#",
      "C",
      "JavaScript (Vue and ReactJS)",
      "MongoDB"
    ],
    "familiar": [
      ".NET",
      "Swift",
      "Kotlin",
      "Assembly language",
      "Waterfall Methodology"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate from Conestoga College, where I studied Software Engineering Technology. I am excited to be challenged by new technologies and expand my skill set as I have learned various programming languages during the duration of my program. During my time at Conestoga College, I have gained experience in web development, mobile development, RDBMS, OOP, and assembly language. My interest in software engineering started in high school, where I pursued many computer science and computer engineering courses. I am intrigued by all aspects of software engineering, whether front-end, back-end, or directly working with a database. Currently, I am working as a software developer and data engineer at Jarvis to improve my skills by learning the latest technologies."
}
