{
  "education": [
    {
      "awards_achievements": [
        "Graduated with Distinction",
        "GPA: 3.49"
      ],
      "degree": "Software Engineering Technology",
      "department": "Applied Computer Science and IT",
      "duration": "2018-2021",
      "school_name": "Conestoga College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_MarissaSchmitt",
  "highlighted_projects": [
    {
      "description": "Created a proof-of-concept EMR system for Otekha Health. This project was built using ReactJS, Java RESTful server, Docker, MongoDB, MySQL, Redis, and HAPI-FHIR API.",
      "git_url": null,
      "name": "Electronic Medical Records System"
    },
    {
      "description": "Implemented a Point-of-Sale system for a Relational Database course within my program. This system used MySQL and the user was able to update, delete, and retrieve data through the .NET WPF frontend. This project highlighted aspects of working with database and communicating the data retrieved from the constructed queries in a user-friendly format.",
      "git_url": null,
      "name": "Point-of-Sale System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Linux cluster monitoring agent to manage and insert resource usage information into a PostgreSQL database. The host usage information was collected through bash commands and automated using crontab.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: In-progress",
        "JDBC App: Developed an application that uses Java Database Connectivity (JDBC) to insert and perform CRUD operations on data stored in a Docker-hosted PostgreSQL database. This project uses JDBC, PSQL, Maven, Docker, DAO, and DTOs.",
        "Grep App: Implemented an application to simulate the grep command available within Linux operating systems. This app was developed using Java, Maven, and Docker. The grep app allows a user to specify a regex, root directory, and output file. The files found within the root directory and any subsequent subdirectories are read then the retrieved lines are compared to the defined regex pattern. If the line matches the regex, it is then written to the output file."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Marissa Schmitt",
  "others": [
    {
      "bullets": [
        "Databases",
        "Big Data",
        "Backend development",
        "Learning new technologies"
      ],
      "title": "Interests"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed a variety of different applications using an Agile methodology. Acted as a team lead role to organize and lead daily scrum meetings with team. Java, Linux, SQL, Docker, and bash scripts were used in developing.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "Otekha Health",
      "description": "Implemented a Electronic Medical Records proof-of-concept system as requested by the client. The tech stack of the system was ReactJS for the frontend and a Java RESTful server for the backend that implements HAPI API, MongoDB, MySQL, and Redis. It was a Docker-built architecture. Synthea was used to generate sample patient FHIR data for testing purposes. MongoDB was used to hold the sample FHIR data retrieved from the RESTful server. MySQL was used for authentication within the app. Redis was used for access control (NGAC).",
      "duration": "2021",
      "title": "Unpaid Intern"
    },
    {
      "company": "Focus Computers Inc",
      "description": "Performed repairs on customers' computers using different software tools and problem-solving techniques. ",
      "duration": "2018",
      "title": "Co-op Student"
    }
  ],
  "skills": {
    "competent": [
      "C++",
      "C#",
      "C",
      "JavaScript (Vue and ReactJS)",
      "MongoDB"
    ],
    "familiar": [
      ".NET",
      "Swift",
      "Kotlin",
      "Assembly language",
      "Waterfall Methodology"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate from Conestoga College where I studied Software Engineering Technology. I am excited to be challenged by new technologies and expand my skillset as I have learned a variety of programming languages during the duration of my program. During my time at Conestoga College, I learned about web development, mobile development, relational databases, object-oriented programming, and assembly language. My interest in software engineering started in high school where I pursued many computer science and computer engineering courses. I am intrigued by all aspects of software engineering whether it be frontend, backend, or working with a database directly. Currently I am working as a software developer/data engineer at Jarvis to improve my skills by learning about core Java programming, design patterns, Maven, and agile development."
}
